
1847-«Семейная картина»
1849-«Свои люди — сочтёмся»
1850-«Неожиданный случай»
1850-«Утро молодого человека»
1851-«Бедная невеста»
1852-«Не в свои сани не садись»
1853-«Бедность не порок»
1854-«Не так живи, как хочется»
1856-«В чужом пиру похмелье»
1856«Доходное место»
1857«Праздничный сон до обеда»
1858-«Не сошлись характерами»
1859-«Воспитанница»
1859-«Гроза»
1860-«Старый друг лучше новых двух»
1861-«Свои собаки грызутся, чужая не приставай»
1861-«Женитьба Бальзаминова»
1861-«Козьма Захарьич Минин-Сухорук»
1863-«Тяжёлые дни»
1863-«Грех да беда на кого не живёт»
1864-«Воевода»
1864-«Шутники»
1865-«На бойком месте»
1866-«Пучина»
1866-«Дмитрий Самозванец и Василий Шуйский»
1866-«Тушино»
1867-«Василиса Мелентьева»
1868-«На всякого мудреца довольно простоты»
1869-«Горячее сердце»
1870-«Бешеные деньги»
1870-«Лес»
1871-«Не всё коту масленица»
1872-«Не было ни гроша, да вдруг алтын»
1873-«Комик семнадцатого столетия»
1873-«Снегурочка»
1874-«Поздняя любовь»
1874-«Трудовой хлеб»
1875-«Волки и овцы»
1876-«Богатые невесты»
1877-«Правда хорошо, а счастье лучше»
1877-«Женитьба Белугина»
1878-«Последняя жертва»
1878-«Бесприданница»
1880-«Сердце не камень»
1881-«Невольницы»
1882-«Таланты и поклонники»
1883-«Без вины виноватые»
1883-«Красавец мужчина»
1885-«Не от мира сего»