import crud

hello_text = 'Текст №1 (Приветственное сообщение)'
all_pieces_text = 'Здесь ты можешь выбрать порядок знакомства с пьесами или предоставить право выбора его величеству рандому'
mood_pieces_text = 'Специфический юмор XIX века или трагедия, разрывающая душу, решать тебе'
alphabet_text = 'Так ты намного быстрее найдешь нужную пьесу'
date_text = 'Именно в таком порядке пьесы выходили из-под пера автора и можно проследить как менялось его отношение к жизни'
comedi_text = 'В конце все герои останутся живы, но жизнь их не сахар'
drama_text = 'Рекомендуем приготовить платочки, финал будет жестким'
info_piece_text = 'Информация о пьесе'
main_menu_text = 'Главное меню'
non_popular_text = 'Скорее всего, после прочтения можно будет блеснуть знаниями в кругу умных людей'
about_authors_text = f'На фото создатели этого прекрасного бота:\n\n' \
                     f'Сергеева Кира\n' \
                     f'Айзиков Никита\n' \
                     f'Герман Светлана'